In [2]:
import numpy as np
import pandas as pd

In [3]:
dict = {"A" : [1, 5, 2], "B" : [4, np.nan, 2], "C" : [np.nan, np.nan, 7]}
dict

{'A': [1, 5, 2], 'B': [4, nan, 2], 'C': [nan, nan, 7]}

In [5]:
df = pd.DataFrame(dict)
df

   A    B    C
0  1  4.0  NaN
1  5  NaN  NaN
2  2  2.0  7.0

In [8]:
#dropna() drops the row/column which has atleast one null
# df.dropna(axis= 1)
df.dropna()

   A    B    C
2  2  2.0  7.0

In [11]:
df.dropna(thresh=2) #drops those who have 2 or more null values

   A    B    C
0  1  4.0  NaN
2  2  2.0  7.0

In [15]:
df

   A    B    C
0  1  4.0  NaN
1  5  NaN  NaN
2  2  2.0  7.0

In [16]:
#replace null values
df["C"].fillna(value= df["A"].mean())

0    2.666667
1    2.666667
2    7.000000
Name: C, dtype: float64

In [18]:
#group by

data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
byComp = df.groupby("Company")
byComp